ekartashov/stm32-air-purity-sensor/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32l4xx_hal.h"
#include "stm32l4xx_hal_gpio.h"
#include "usb_device.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include <math.h>
#include "driver_serial.h"
#include "ssd1306.h"
#include "ssd1306_conf.h"
#include "ssd1306_fonts.h"
#include "ssd1306_tests.h"
#include "driver_pwm-buzzer.h"
#include "oled_graph.h"
#include "driver_scd4x.h"
#include "driver_scd4x_interface.h"
#include "driver_scd4x_debug.h"
#include "driver_sen5x.h"
#include "driver_sen5x_interface.h"
#include "driver_sen5x_debug.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */
/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
I2C_HandleTypeDef hi2c4;

TIM_HandleTypeDef htim2;

/* USER CODE BEGIN PV */
static scd4x_handle_t scd4x_handle; // Initialized in SCD4x_Init()
static sen5x_handle_t sen5x_handle; // Initialized in SEN5X_Init()

static const Buzzer_Note alert_melody[] = {
    { NOTE_C4, 166 },
    { NOTE_A4, 166 },
    { NOTE_F4, 166 },
    { 0,       100 },  // 0 = rest
    { 0xFFFF,  0 },    // terminator
};
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_I2C4_Init(void);
static void MX_TIM2_Init(void);
/* USER CODE BEGIN PFP */
static void SCD4x_Init(scd4x_handle_t *scd4x_handle_p);
static void SEN5X_Init(sen5x_handle_t *sen5x_handle_p);
static void run_debug_tests(void);
/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */
  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_I2C4_Init();
  MX_TIM2_Init();
  MX_USB_DEVICE_Init();
  /* USER CODE BEGIN 2 */

  uint32_t startup_time = HAL_GetTick();
  uint8_t in_debug_mode = 0;
  while (HAL_GetTick() - startup_time < 1000)
  {
    if (HAL_GPIO_ReadPin(BTN_1_GPIO_Port, BTN_1_Pin) == GPIO_PIN_SET)
    {
      // Button is pressed during startup window
      uint32_t btn_press_start = HAL_GetTick();
      while (HAL_GPIO_ReadPin(BTN_1_GPIO_Port, BTN_1_Pin) == GPIO_PIN_SET)
      {
        if (HAL_GetTick() - btn_press_start >= 100)
        {
          in_debug_mode = 1;
          break;
        }
        HAL_Delay(10); // Small delay to prevent tight loop
      }
      break;
    }
    HAL_Delay(100); // Check periodically
  }
  if (in_debug_mode)
  {
    // Buzzer and LED blinking sequence
    Buzzer_PlayMelody(alert_melody);
    for (int8_t ctr = 0; ctr < 6; ++ctr){
      HAL_GPIO_TogglePin(LED_HIGH_GPIO_Port, LED_HIGH_Pin);
      HAL_Delay(33);
      HAL_GPIO_TogglePin(LED_MID_GPIO_Port, LED_MID_Pin);
      HAL_Delay(33);
      HAL_GPIO_TogglePin(LED_LOW_GPIO_Port, LED_LOW_Pin);
      HAL_Delay(33);
    }
  }

  ssd1306_Init();
  SCD4x_Init(&scd4x_handle);
  SEN5X_Init(&sen5x_handle);

  // Update the display
  ssd1306_UpdateScreen();

  /* USER CODE END 2 */

  /* USER CODE BEGIN WHILE */
  if (in_debug_mode) 
  {
    serial_print("DEBUG MODE: Running peripheral tests...\r\n");
    while (1) {
      run_debug_tests();
      HAL_Delay(1000);
    }
  }
  // int counter = 0;
  // int arrangement = 1;
  // uint32_t start_time = HAL_GetTick();

  while (1)
  {
    HAL_Delay(1000);
    // // Check if 10 seconds have passed
    // uint32_t current_time = HAL_GetTick();
    // if(current_time - start_time > 10000) {
    //     // Move to next arrangement
    //     arrangement = (arrangement + 1) % 7;  // 7 different arrangements
    //     start_time = current_time;
    // }

    // // Generate new data for all functions
    // float new_value_1 = 50.0f + 20.0f * sinf(counter * 0.2f);
    // float new_value_2 = 50.0f + 20.0f * cosf(counter * 0.2f);
    // float new_value_3 = 50.0f + 20.0f * tanf(counter * 0.1f);
    // float new_value_4 = (counter % 20 < 10) ? 20.0f : 80.0f;

    // // Clamp values to prevent extreme spikes
    // if(new_value_3 > 100.0f) new_value_3 = 100.0f;
    // if(new_value_3 < 0.0f) new_value_3 = 0.0f;

    // // Add new data to each buffer
    // ring_buffer_push(&sensor_ring_buffer_1, new_value_1);
    // ring_buffer_push(&sensor_ring_buffer_2, new_value_2);
    // ring_buffer_push(&sensor_ring_buffer_3, new_value_3);
    // ring_buffer_push(&sensor_ring_buffer_4, new_value_4);

    // // Clear screen
    // ssd1306_Fill(Black);

    // // Select and arrange graphs based on current arrangement
    // switch(arrangement) {
    //     case 0:
    //         // 1 graph spanning full screen
    //         // Using the new API - we'll use graph_plot directly for this case
    //         graph_plot(&sensor_ring_buffer_1, 0, 0, SSD1306_WIDTH, SSD1306_HEIGHT, 1, 0.0f, 100.0f, "CO2");
    //         break;
    //     case 1:
    //         // 2 graphs: Top-bottom
    //         // Debug: Draw graph boundaries to visualize the issue
    //         graph_plots_1t1b(&sensor_ring_buffer_1, &sensor_ring_buffer_2, 0, 0, SSD1306_WIDTH, SSD1306_HEIGHT, 2, "CO2", "VOC");
    //         break;
    //     case 2:
    //         // 2 graphs: Left-right
    //         graph_plots_1l1r(&sensor_ring_buffer_1, &sensor_ring_buffer_2, 0, 0, SSD1306_WIDTH, SSD1306_HEIGHT, 2, "CO2", "VOC");
    //         break;
    //     case 3:
    //         // 3 graphs: 1 wide on top, 2 shallow on bottom
    //         graph_plots_1t2b(&sensor_ring_buffer_1, &sensor_ring_buffer_2, &sensor_ring_buffer_3, 0, 0, SSD1306_WIDTH, SSD1306_HEIGHT, 2, "CO2", "VOC", "NOx");
    //         break;
    //     case 4:
    //         // 3 graphs: 2 shallow on top, 1 wide on bottom
    //         graph_plots_2t1b(&sensor_ring_buffer_1, &sensor_ring_buffer_2, &sensor_ring_buffer_3, 0, 0, SSD1306_WIDTH, SSD1306_HEIGHT, 2, "CO2", "VOC", "PM");
    //         break;
    //     case 5:
    //         // 3 graphs: 1 tall on left, 2 short on right
    //         graph_plots_1l2r(&sensor_ring_buffer_1, &sensor_ring_buffer_2, &sensor_ring_buffer_3, 0, 0, SSD1306_WIDTH, SSD1306_HEIGHT, 2, "CO2", "VOC", "NOx");
    //         break;
    //     case 6:
    //         // 4 graphs: 2x2 grid (custom size)
    //         graph_plots_2t2b(&sensor_ring_buffer_1, &sensor_ring_buffer_2, &sensor_ring_buffer_3, &sensor_ring_buffer_4, 0, 0, SSD1306_WIDTH, SSD1306_HEIGHT, 2, "CO2", "VOC", "NOx", "PM");
    //         break;
    // }

    // // Draw debug visualization (this will show the blinking dots and screen outline)
    // // debug_screen_edges();

    // // Update the display
    // ssd1306_UpdateScreen();

    // counter++;
    // // HAL_Delay(100);
    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */
  }
  /* USER CODE END 3 */
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  /** Configure the main internal regulator output voltage
  */
  if (HAL_PWREx_ControlVoltageScaling(PWR_REGULATOR_VOLTAGE_SCALE1_BOOST) != HAL_OK)
  {
    Error_Handler();
  }

  /** Initializes the RCC Oscillators according to the specified parameters
  * in the RCC_OscInitTypeDef structure.
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI48|RCC_OSCILLATORTYPE_HSI;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.HSI48State = RCC_HSI48_ON;
  RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSI;
  RCC_OscInitStruct.PLL.PLLM = 2;
  RCC_OscInitStruct.PLL.PLLN = 30;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
  RCC_OscInitStruct.PLL.PLLQ = RCC_PLLQ_DIV2;
  RCC_OscInitStruct.PLL.PLLR = RCC_PLLR_DIV2;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

  /** Initializes the CPU, AHB and APB buses clocks
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_5) != HAL_OK)
  {
    Error_Handler();
  }
}

/**
  * @brief I2C4 Initialization Function
  * @param None
  * @retval None
  */
static void MX_I2C4_Init(void)
{

  /* USER CODE BEGIN I2C4_Init 0 */

  /* USER CODE END I2C4_Init 0 */

  /* USER CODE BEGIN I2C4_Init 1 */

  /* USER CODE END I2C4_Init 1 */
  hi2c4.Instance = I2C4;
  hi2c4.Init.Timing = 0x30A175AB;
  hi2c4.Init.OwnAddress1 = 0;
  hi2c4.Init.AddressingMode = I2C_ADDRESSINGMODE_7BIT;
  hi2c4.Init.DualAddressMode = I2C_DUALADDRESS_DISABLE;
  hi2c4.Init.OwnAddress2 = 0;
  hi2c4.Init.OwnAddress2Masks = I2C_OA2_NOMASK;
  hi2c4.Init.GeneralCallMode = I2C_GENERALCALL_DISABLE;
  hi2c4.Init.NoStretchMode = I2C_NOSTRETCH_DISABLE;
  if (HAL_I2C_Init(&hi2c4) != HAL_OK)
  {
    Error_Handler();
  }

  /** Configure Analogue filter
  */
  if (HAL_I2CEx_ConfigAnalogFilter(&hi2c4, I2C_ANALOGFILTER_ENABLE) != HAL_OK)
  {
    Error_Handler();
  }

  /** Configure Digital filter
  */
  if (HAL_I2CEx_ConfigDigitalFilter(&hi2c4, 0) != HAL_OK)
  {
    Error_Handler();
  }
  /* USER CODE BEGIN I2C4_Init 2 */

  /* USER CODE END I2C4_Init 2 */

}

/**
  * @brief TIM2 Initialization Function
  * @param None
  * @retval None
  */
static void MX_TIM2_Init(void)
{

  /* USER CODE BEGIN TIM2_Init 0 */

  /* USER CODE END TIM2_Init 0 */

  TIM_ClockConfigTypeDef sClockSourceConfig = {0};
  TIM_MasterConfigTypeDef sMasterConfig = {0};
  TIM_OC_InitTypeDef sConfigOC = {0};

  /* USER CODE BEGIN TIM2_Init 1 */

  /* USER CODE END TIM2_Init 1 */
  htim2.Instance = TIM2;
  htim2.Init.Prescaler = 119;
  htim2.Init.CounterMode = TIM_COUNTERMODE_UP;
  htim2.Init.Period = 999;
  htim2.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
  htim2.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_DISABLE;
  if (HAL_TIM_Base_Init(&htim2) != HAL_OK)
  {
    Error_Handler();
  }
  sClockSourceConfig.ClockSource = TIM_CLOCKSOURCE_INTERNAL;
  if (HAL_TIM_ConfigClockSource(&htim2, &sClockSourceConfig) != HAL_OK)
  {
    Error_Handler();
  }
  if (HAL_TIM_PWM_Init(&htim2) != HAL_OK)
  {
    Error_Handler();
  }
  sMasterConfig.MasterOutputTrigger = TIM_TRGO_RESET;
  sMasterConfig.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE;
  if (HAL_TIMEx_MasterConfigSynchronization(&htim2, &sMasterConfig) != HAL_OK)
  {
    Error_Handler();
  }
  sConfigOC.OCMode = TIM_OCMODE_PWM1;
  sConfigOC.Pulse = 0;
  sConfigOC.OCPolarity = TIM_OCPOLARITY_HIGH;
  sConfigOC.OCFastMode = TIM_OCFAST_ENABLE;
  if (HAL_TIM_PWM_ConfigChannel(&htim2, &sConfigOC, TIM_CHANNEL_1) != HAL_OK)
  {
    Error_Handler();
  }
  /* USER CODE BEGIN TIM2_Init 2 */

  /* USER CODE END TIM2_Init 2 */
  HAL_TIM_MspPostInit(&htim2);

}

/**
  * @brief GPIO Initialization Function
  * @param None
  * @retval None
  */
static void MX_GPIO_Init(void)
{
  GPIO_InitTypeDef GPIO_InitStruct = {0};
  /* USER CODE BEGIN MX_GPIO_Init_1 */

  /* USER CODE END MX_GPIO_Init_1 */

  /* GPIO Ports Clock Enable */
  __HAL_RCC_GPIOE_CLK_ENABLE();
  __HAL_RCC_GPIOA_CLK_ENABLE();
  __HAL_RCC_GPIOD_CLK_ENABLE();
  __HAL_RCC_GPIOG_CLK_ENABLE();
  HAL_PWREx_EnableVddIO2();

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(LED_1_GPIO_Port, LED_1_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(LED_2_GPIO_Port, LED_2_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(GPIOG, LED_LOW_Pin|LED_MID_Pin|LED_HIGH_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pin : BTN_1_Pin */
  GPIO_InitStruct.Pin = BTN_1_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_IT_RISING;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(BTN_1_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pin : LED_1_Pin */
  GPIO_InitStruct.Pin = LED_1_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(LED_1_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pin : LED_2_Pin */
  GPIO_InitStruct.Pin = LED_2_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(LED_2_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pins : LED_LOW_Pin LED_MID_Pin LED_HIGH_Pin */
  GPIO_InitStruct.Pin = LED_LOW_Pin|LED_MID_Pin|LED_HIGH_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOG, &GPIO_InitStruct);

  /* EXTI interrupt init*/
  HAL_NVIC_SetPriority(EXTI0_IRQn, 0, 0);
  HAL_NVIC_EnableIRQ(EXTI0_IRQn);

  /* USER CODE BEGIN MX_GPIO_Init_2 */

  /* USER CODE END MX_GPIO_Init_2 */
}

/* USER CODE BEGIN 4 */
static void SCD4x_Init(scd4x_handle_t *scd4x_handle_p)
{
    uint8_t res;

    /* Link the interface functions */
    DRIVER_SCD4X_LINK_INIT(scd4x_handle_p, scd4x_handle_t);
    DRIVER_SCD4X_LINK_IIC_INIT(scd4x_handle_p, scd4x_interface_iic_init);
    DRIVER_SCD4X_LINK_IIC_DEINIT(scd4x_handle_p, scd4x_interface_iic_deinit);
    DRIVER_SCD4X_LINK_IIC_WRITE_COMMAND(scd4x_handle_p, scd4x_interface_iic_write_cmd);
    DRIVER_SCD4X_LINK_IIC_READ_COMMAND(scd4x_handle_p, scd4x_interface_iic_read_cmd);
    DRIVER_SCD4X_LINK_DELAY_MS(scd4x_handle_p, scd4x_interface_delay_ms);
    DRIVER_SCD4X_LINK_DEBUG_PRINT(scd4x_handle_p, scd4x_interface_debug_print);


    /* Tell the driver which chip you have */
    res = scd4x_set_type(scd4x_handle_p, SCD41);
    if (res != 0)
    {
        scd4x_interface_debug_print("scd4x_set_type failed: %u\r\n", res);
        Error_Handler();
    }

    /* Initialize the chip (calls iic_init internally) */
    res = scd4x_init(scd4x_handle_p);
    if (res != 0)
    {
        scd4x_interface_debug_print("scd4x_init failed: %u\r\n", res);
        Error_Handler();
    }
}

static void SEN5X_Init(sen5x_handle_t *sen5x_handle_p)
{
    uint8_t res;

    /* Link the interface functions */
    DRIVER_SEN5X_LINK_INIT(sen5x_handle_p, sen5x_handle_t);
    DRIVER_SEN5X_LINK_IIC_INIT(sen5x_handle_p, sen5x_interface_iic_init);
    DRIVER_SEN5X_LINK_IIC_DEINIT(sen5x_handle_p, sen5x_interface_iic_deinit);
    DRIVER_SEN5X_LINK_IIC_WRITE_COMMAND(sen5x_handle_p, sen5x_interface_iic_write_cmd);
    DRIVER_SEN5X_LINK_IIC_READ_COMMAND(sen5x_handle_p, sen5x_interface_iic_read_cmd);
    DRIVER_SEN5X_LINK_DELAY_MS(sen5x_handle_p, sen5x_interface_delay_ms);
    DRIVER_SEN5X_LINK_DEBUG_PRINT(sen5x_handle_p, sen5x_interface_debug_print);

    /* Initialize the chip (calls iic_init internally) */
    res = sen5x_init(sen5x_handle_p);
    if (res != 0)
    {
        sen5x_interface_debug_print("sen5x_init failed: %u\r\n", res);
        Error_Handler();
    }

    /* Start measurement (similar to SCD4X periodic measurement) */
    res = sen5x_start_measurement(sen5x_handle_p);
    if (res != 0)
    {
        sen5x_interface_debug_print("sen5x_start_measurement failed: %u\r\n", res);
        Error_Handler();
    }

    /* Wait for sensor to start producing data (similar to SCD4X debug test) */
    sen5x_interface_delay_ms(5000); // Wait 5 seconds for first measurement
}
/* USER CODE END 4 */

/* USER CODE BEGIN 5 */
// This function will run various debug tests for different components
static void run_debug_tests(void)
{
    // Call SEN5X debug test
    sen5x_run_full_test_once();

    // Call SCD4x debug test
    scd4x_run_full_test_once();

    // Call SSD1305 debug test
    // ssd1306_TestAll();

}
/* USER CODE END 5 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}
#ifdef USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
